# RebarAlignmentOptions Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarAlignmentOptions Property
ParameterTypeId Class See Also
---
"Bar Alignment"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarAlignmentOptions { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarAlignmentOptions As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarAlignmentOptions {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace